{
    "title": "Project Documentation",
    "date-created": "2024-5-20",
    "last-updated": "2024-5-22",
    "sections": [
        {
            "title": "Overview",
            "text": "This application aims to both be a proof-of-concept and a professional solution for users seeking to host a blog or news platform. This documentations aims to cater towards users with technical backgrounds and users without technical backgrounds and users without technical backgrounds who want to use this app while understanding how to customize it and use it effectively.",
            "text1": "If you are a user without a technical background, feel free to skip the technical sections and read the User Guide section directly, although I have written the documentation to cater towards learners of computer science. - H249"
        },
        {
            "title": "Installation and Environment",
            "text": "> Clone the Git repository at https://github.com/Hussein-249/dynamic-multipage-template",
            "text1": "> Or via the command line:",
            "code1": "git clone https://github.com/Hussein-249/dynamic-multipage-template",
            "text2": "> Install the packages included in package.json using",
            "code2": "npm install",
            "text3": "> Run the application using either",
            "code3": "npm start",
            "text4": "> or",
            "code4": "node server.js"
        },
        {
            "title": "Software Design",
            "text": "This application is not Object-Oriented, and aims to loosely follow a MVC (Model-View-Control) pattern, as seen in the database module. An Object-Oriented approach did not suit the aim of this project, as the primary data type being handled is an article of text, which is already abstracted via the MVC layers."
        },
        {
            "title": "Development Process",
            "text": "The following paragraphs detail the main development challenges encountered during development, and the methods implemented to overcome them."
        },
        {
            "title": "Module Documentation",
            "text": "Coming Soon"
        },
        {
            "title": "User / Admin Guide",
            "text": "Coming Soon"
        },
        {
            "title": "Scalability analysis",
            "text": "This project aims to be scalable through EJS templates. All pages viewed are dynamically generated via server-side rendering, which is more optimal for SEO as opposed to client-side rendering. For example, all articles are generated by retrieving text from the database and then rendering it via the same article.ejs template. The disadvantage is, naturally, that there is little customization. However, as this project aims to be mobile-friendly, complex article layouts would be difficult to implement, which is contradictory to this project's aim.",
            "text1": "In its current iteration, the express server does not handle high volumes of traffic well, which may result in failed connections under high loads."
        }        
    ]
}